var map = L.map('map').setView([16.4734, 102.824], 14); // พิกัดในมหาวิทยาลัยขอนแก่น
L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
    maxZoom: 19,
}).addTo(map);

// ตำแหน่งของสถานี
var stations = {
    "ที่พักญาติ":[16.476117, 102.812641],
    "คณะเกษตรศาสตร์1":[16.474451, 102.820614],
    "คณะเกษตรศาสตร์3":[16.477212, 102.821758],
    "โรงพยาบาลศรีนครินทร์":[16.467199, 102.830746],
    "ศูนย์หัวใจสิริกิติ์":[16.466279, 102.830641],
    "คอมเพล็กซ์":[16.477264, 102.823369],
    "โรงยิมเก่า":[16.477634, 102.818686],
    "สนามยิงปืน":[16.477710, 102.818019],
    "คณะเทศโนโลยี1":[16.474319, 102.820673],
    "คณะวิศวกรรมศาสตร์1":[16.471039, 102.824350],
    "คณะวิศวะกรรมศสตร์2":[16.471142, 102.822993],
    "อาคารจอดรถสถานีชาร์จไฟฟ้า":[16.466036, 102.807785],
    "สระพลาสติก":[16.475568, 102.817674],
    "คณะวิทยาศาสตร์":[16.475032, 102.825077],
    "คณะเทคนิคการแพทย์":[16.466713, 102.828181],
    "คณะเภสัชศาสตร์1":[16.470640, 102.827987],
    "คณะเกษตรศาสตร์1":[16.476046, 102.822668],
    "คณะมนุษยศาสตร์และสังคมศาสตร์":[16.476594, 102.826981],
    "คณะศิลปกรรมศาสตร์":[16.468990, 102.816923],
    "คณะทันตแพทยศาสตร์":[16.466488, 102.827986],
    "คณะสัตวแพทยศาสตร์":[16.478239, 102.831967],
    "คณะพยาบาลศาสตร์":[16.470034, 102.824665],
    "KKBS":[16.474502, 102.825405],
    "คณะสถาปัตยกรรมศาสตร์":[16.472300, 102.828045],
    "คณะเทคโนโลยี2":[16.473541, 102.821990],
    "วิทยาลัยปกครองท้องถิ่น":[16.473673, 102.831690],
    "ลานจอดรถหอพัก 8 หลัง":[16.479435, 102.808442],
    "คณะนิติศาสตร์":[16.449944, 102.815529],
    "หอพักนักศึกษาแพทย์":[16.470929, 102.823482],
    "คณะแพทย์ศาสตร์":[16.470477, 102.828068],
    "แฟลตศูนย์แพทย์":[16.467937, 102.823719],
    "หมู่บ้านศูนย์แพทย์1":[16.469421, 102.822382],
    "หมู่บ้านศูนย์แพทย์4":[16.468935, 102.821268],
    "หอพักนศ.พยาบาล":[16.468423, 102.817477],
    "หอศิลป์":[16.4705,102.8224],
    "ศูนย์ประชุมกาญจนาภิเษก":[16.446665, 102.815143],
    "แฟลตป่าดู่1":[16.455548, 102.812846],
    "แฟลตป่าดู่2":[16.454991, 102.815182],
    "ปตท.":[16.478381, 102.814011],
    "สถาบันขงจื่อ":[16.474521, 102.830126],
    "สนามรักบี้":[16.475243, 102.815944],
    "โรงอาหารหนองแวง":[16.465594, 102.825733],
    "ประตูกังสดาล":[16.465403, 102.827794],
    "วงเวียนศูนย์หัวใจสิริกิติ์":[16.465814, 102.829367],
    "แฟลต14":[16.465868, 102.828321],
    "JK เครื่องเขียน":[16.463436, 102.827538],
    "ร้านพรพระ":[16.460849, 102.827959],
    "บึงหนองแวงตราชู":[16.459100, 102.828139],
    "YOUR SMILE":[16.458498, 102.828014],
    "โรงแรมบายาสิตา":[16.477508, 102.831952],
    "โรงเรียนสาธิตมอดินแดง":[16.481205, 102.831749],
    "ศาลเจ้าพ่อมอ":[16.476920, 102.831977],
    "ประตูเจ้าพ่อมอ":[16.476024, 102.831253],
    "โรงพิมพ์":[16.472255, 102.821634],
    "คุ้มศรีฐาน":[16.445187, 102.812636],
    "พิพิธภัณฑ์ธรรมชาติวิทยา":[16.445830, 102.811494],
    "หอศิลป์":[16.444504, 102.814721],
    "อุทยานการเกษตร1":[16.466404, 102.815469],
    "หน้าอาคารสิริคุณากร":[16.469887, 102.816219],
    "ตรงข้ามอาคารสิริคุณากร":[16.469869, 102.816477],
    "อาคารสิริคุณากร":[16.469552, 102.815702],
    "ลานจอรถอุทยานการเกษตร":[16.468866, 102.815840],
    "โรงเรียนสาธิตมหาวิทยาลัยขอนแก่น":[16.449931, 102.815640],
    "ประตูศรีฐาน":[16.442518, 102.814827],
    "อุทยานการเกษตร2":[16.466749, 102.815335],
    "บ้านสวนมอ":[16.480251, 102.805194],
    "วิมานดิน":[16.480739, 102.807144],
    "Golden Living":[16.480341, 102.810397],
    "7-11 หลังหอ 8":[16.480184, 102.811889],
    "ร้านพู่กันเครื่องเขียน":[16.479871, 102.814776],
    "หอพักมอแดงเพลส":[16.480014, 102.815649],
    "ร้านชบา":[16.481730, 102.815997],
    "เคี้ยงหลังมอ":[16.483321, 102.816261],
    "ครัวโอมหมูกรอบ":[16.485139, 102.816266],
    "บ้านพักสบาย":[16.485139, 102.816266],
    "เกษียรสินธุ์ปาร์ค":[16.484311, 102.818122],
    "พิมานคอนโด":[16.482990, 102.819185],
    "โรงอาหาร U-center":[16.479864, 102.818881],
    "หอในชาย 9":[16.479122, 102.818270],
    "หอในชาย 8":[16.477864, 102.818209],
    "โรงชาย":[16.477693, 102.819749],
    "Complex":[16.477264, 102.823369],
    "กาแฟเด้อหล่า":[16.476954, 102.825863],
    "สถาบันลุ่มน้ำโขง":[16.474368, 102.828210],
    "หมู่บ้านศูนย์แพทย์":[16.467540, 102.821613],
    "โรงอาหารคณะพยาบาล":[16.470127, 102.824592],
    "คณะเภสัชศาสตร์2":[16.471072, 102.827325],
    "คณะศึกษาศาสตร์":[16.472805, 102.827961],
    "ศูนย์รถมอเตอร์ไซไฟฟ้า":[16.475403, 102.828167],
    "หอสมุดมหาวิทยาลัยขอนแก่น":[16.477075, 102.822994],
    "คณะเกษตรศาสตร์2":[16.476057, 102.819856],
    "หออินเตอร์":[16.478637, 102.811939],
    "หอพัก 8 หลัง":[16.478771, 102.810154]
    // เพิ่มเติมตามความต้องการ
};
for (var key in stations) {
    L.marker(stations[key]).addTo(map).bindPopup(key);
}

function calculateRoute() {
    var start = document.getElementById("start").value;
    var end = document.getElementById("end").value;

    var startCoords = stations[start];
    var endCoords = stations[end];
     var routes = {
            bus1: ["ลานจอดรถหอพัก 8 หลัง", "บ้านสวนมอ", "วิมานดิน", "Golden Living", "7-11 หลังหอ 8", "ร้านพู่กันเครื่องเขียน", "หอพักมอแดงเพลส", "ร้านชบา", "เคี้ยงหลังมอ", "ครัวโอมหมูกรอบ", "บ้านพักสบาย", "เกษียรสินธุ์ปาร์ค", "พิมานคอนโด", "โรงอาหาร U-center", "หอในชาย 9", "หอในชาย 8", "โรงชาย", "Complex", "กาแฟเด้อหล่า", "สถาบันลุ่มน้ำโขง", "KKBS", "คณะวิทยาศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "คณะแพทย์ศาสตร์", "คณะเทคนิคการแพทย์", "แฟลตศูนย์แพทย์", "หมู่บ้านศูนย์แพทย์1", "หมู่บ้านศูนย์แพทย์4", "หอพักนศ.พยาบาล", "อาคารสิริคุณากร", "คณะศิลปกรรมศาสตร์", "หมู่บ้านศูนย์แพทย์", "โรงอาหารคณะพยาบาล", "โรงอาหารคณะพยาบาล", "คณะเภสัชศาสตร์2", "คณะศึกษาศาสตร์", "ศูนย์รถมอเตอร์ไซไฟฟ้า", "คณะมนุษยศาสตร์และสังคมศาสตร์", "หอสมุดมหาวิทยาลัยขอนแก่น", "คณะเกษตรศาสตร์3", "โรงยิมเก่า", "สนามยิงปืน", "หออินเตอร์", "หอพัก 8 หลัง", "ลานจอดรถหอพัก 8 หลัง"],
            bus2: ["ลานจอดรถหอพัก 8 หลัง", "หอพัก 8 หลัง","หออินเตอร์", "ที่พักญาติ", "สระพลาสติก", "คณะเกษตรศาสตร์2", "คณะเทคโนโลยี1", "คณะวิศวกรรมศาสตร์1", "คณะวิศวกรรมศาสตร์2", "คณะพยาบาลศาสตร์", "แฟลตศูนย์แพทย์", "โรงอาหารหนองแวง", "ประตูกังสดาล", "คณะทันตแพทยศาสตร์", "วงเวียนศูนย์หัวใจสิริกิติ์", "แฟลต14", "JK เครื่องเขียน", "ร้านพรพระ", "บึงหนองแวงตราชู", "YOUR SMILE", "ร้านพรพระ", "JK เครื่องเขียน", "ประตูกังสดาล", "คณะทันตแพทยศาสตร์", "คณะเภสัชศาสตร์1", "คณะศึกษาศาสตร์", "KKBS", "คณะวิทยาศาสตร์", "ศูนย์รถมอเตอร์ไซไฟฟ้า", "คณะมนุษยศาสตร์และสังคมศาสตร์", "หอสมุดมหาวิทยาลัยขอนแก่น", "โรงแรมบายาสิตา", "คณะสัตวแพทยศาสตร์", "โรงเรียนสาธิตมอดินแดง", "ศาลเจ้าพ่อมอ","ประตูเจ้าพ่อมอ", "คณะเกษตรศาสตร์3", "โรงยิมเก่า", "สนามยิงปืน", "หออินเตอร์", "หอพัก 8 หลัง", "ลานจอดรถหอพัก 8 หลัง"],
            bus3: ["ลานจอดรถหอพัก 8 หลัง", "หอพัก 8 หลัง","หออินเตอร์","ปตท.", "Aหอในชาย 8", "โรงชาย", "Complex", "กาแฟเด้อหล่า", "โรงแรมบายาสิตา", "คณะสัตวแพทยศาสตร์", "โรงเรียนสาธิตมอดินแดง", "ศาลเจ้าพ่อมอ","ประตูเจ้าพ่อมอ", "สถาบันขงจื่อ", "วิทยาลัยการปกครอง", "โรงพยาบาลศรีนครินทร์", "ศูนย์หัวใจสิริกิติ์", "วงเวียนศูนย์หัวใจสิริกิติ์", "แฟลต14", "คณะทันตแพทยศาสตร์", "คณะเทคนิคการแพทย์", "โรงอาหารคณะพยาบาล", "หอพักนักศึกษาแพทย์", "โรงพิมพ์", "คณะเทคโนโลยี2", "คณะเกษตรศาสตร์1", "คณะเกษตรศาสตร์3", "โรงยิมเก่า", "สนามรักบี้", "ที่พักญาติ", "หออินเตอร์", "หอพัก 8 หลัง", "ลานจอดรถหอพัก 8 หลัง"],
            bus4: ["อาคารจอดรถสถานีชาร์จไฟฟ้า", "แฟลตป่าดู่1", "พิพิธภัณฑ์ธรรมชาติวิทยา", "คุ้มศรีฐาน", "หอศิลป์", "ศูนย์ประชุมกาญจนาภิเษก", "คณะนิติศาสตร์", "แฟลตป่าดู่2", "อุทยานการเกษตร2", "อาคารสิริคุณากร", "หน้าอาคารสิริคุณากร", "คณะเทคโนโลยี1", "คณะเกษตรศาสตร์2", "คณะเกษตรศาสตร์3", "คณะเกษตรศาสตร์1", "คณะเทคโนโลยี2", "ตรงข้ามอาคารสิริคุณากร", "ลานจอรถอุทยานการเกษตร", "อุทยานการเกษตร1", "แฟลตป่าดู่2", "โรงเรียนสาธิตมหาวิทยาลัยขอนแก่น", "ศูนย์ประชุมกาญจนาภิเษก", "ประตูศรีฐาน", "คุ้มศรีฐาน", "พิพิธภัณฑ์ธรรมชาติวิทยา", "แฟลตป่าดู่1", "อาคารจอดรถสถานีชาร์จไฟฟ้า"]
     };
// ฟังก์ชันคำนวณเส้นทางพร้อมเปลี่ยนรถ
function calculateMultiRoute(start, end) {
    var startRoute = null;
    var endRoute = null;

    // หาว่ารถบัสไหนผ่านสถานีเริ่มต้นและปลายทาง
    for (var bus in routes) {
        if (routes[bus].includes(start)) startRoute = bus;
        if (routes[bus].includes(end)) endRoute = bus;
    }

    if (startRoute && endRoute) {
        if (startRoute === endRoute) {
            // หากสถานีอยู่ในเส้นทางเดียวกัน
            createRoute([start, end], startRoute);
        } else {
            // หาเส้นทางที่มีสถานีเชื่อมต่อระหว่างสองเส้นทาง
            for (var transferStation of routes[startRoute]) {
                if (routes[endRoute].includes(transferStation)) {
                    createRoute([start, transferStation], startRoute);
                    createRoute([transferStation, end], endRoute);
                    break;
                }
            }
        }
    } else {
        alert("ไม่พบเส้นทางที่เชื่อมต่อกันระหว่างสถานีเริ่มต้นและปลายทาง");
    }
}

// ฟังก์ชันสร้างเส้นทางบนแผนที่
function createRoute(stations, bus) {
    var waypoints = stations.map(station => L.latLng(stations[station][0], stations[station][1]));
    L.Routing.control({
        waypoints: waypoints,
        lineOptions: {
            styles: [{ color: getBusColor(bus), weight: 6 }]
        }
    }).addTo(map);
}

// ฟังก์ชันเลือกสีเส้นทางตามรถบัส
function getBusColor(bus) {
    switch(bus) {
        case "bus1": return "blue";
        case "bus2": return "yellow";
        case "bus3": return "red";
        case "bus4": return "green";
        default: return "black";
    }
}



