// script.js
var map = L.map('map').setView([16.4734, 102.824], 14); // พิกัดในมหาวิทยาลัยขอนแก่น
L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
    maxZoom: 19,
}).addTo(map);

// ตำแหน่งของสถานี
var stations = {
    "ที่พักญาติ":[16.476117, 102.812641],
    "สระพลาสติก":[16.474429, 102.815982],
    "คณะเกษตรศาสตร์1":[16.474451, 102.820614],
    "โรงพยาบาลศรีนครินทร์":[16.467199, 102.830746],
    "ศูนย์หัวใจสิริกิติ์":[16.466279, 102.830641],
    "คอมเพล็กซ์":[16.477264, 102.823369],
    "โรงยิมเก่า":[16.477634, 102.818686],
    "สนามยิงปืน":[16.477710, 102.818019],
    "คณะเทศโนโลยี1":[16.473496, 102.821960],
    "คณะวิศวกรรมศาสตร์1":[16.471039, 102.824350],
    "คณะวิศวะกรรมศสตร์2":[16.471142, 102.822993],
    "อาคารจอดรถสถานีชาร์จไฟฟ้า":[16.466036, 102.807785],
    "อาคารเฉลิมพระเกียรติ 72 พรรษา":[16.4733,102.8247],3333333333333333333333333333333333333333333333333333333333333
    "คณะวิศวกรรมศาสตร์3":[16.475568, 102.817674],
    "คณะวิทยาศาสตร์":[16.475032, 102.825077],
    "คณะเทคนิคการแพทย์":[16.466713, 102.828181],
    "คณะเภสัชศาสตร์":[16.470640, 102.827987],
    "คณะเกษตรศาสตร์1":[16.476046, 102.822668],
    "คณะมนุษยศาสตร์และสังคมศาสตร์":[16.476594, 102.826981],
    "คณะศิลปกรรมศาสตร์":[16.468990, 102.816923],
    "คณะทันตแพทยศาสตร์":[16.466488, 102.827986],
    "คณะสัตวแพทยศาสตร์":[16.478239, 102.831967],
    "คณะพยาบาลศาสตร์":[16.470034, 102.824665],
    "KKBS":[16.474502, 102.825405],
    "คณะสถาปัตยกรรมศาสตร์":[16.472300, 102.828045],
    "คณะเทคโนโลยี2":[16.473541, 102.821990],
    "วิทยาลัยปกครองท้องถิ่น":[16.473673, 102.831690],
    "ลานจอดรถหอพัก 8 หลัง":[16.479435, 102.808442],
    "คณะนิติศาสตร์":[16.449944, 102.815529],
    "หอพักนักศึกษาแพทย์":[16.470929, 102.823482],
    "ประตู 2":[16.4735,102.8232],
    "ประตู 3":[16.4741,102.8233],
    "ประตู 4":[16.471,102.8212],
    "ประตู 5":[16.4722,102.8205],
    "ประตู 6":[16.4734,102.82],
    "ประตู 7":[16.4746,102.8197],
    "ประตู 8":[16.4758,102.8192],
    "หอศิลป์":[16.4705,102.8224],
    "ศูนย์ประชุมกาญจนาภิเษก":[16.446665, 102.815143],
    "แฟลตป่าดู่1":[16.455548, 102.812846],
    "แฟลตป่าดู่2":[16.454991, 102.815182],
    "ปตท.":[16.478381, 102.814011],
    "สถาบันขงจื่อ":[16.474521, 102.830126],
    "สนามรักบี้":[16.475243, 102.815944],
    "โรงอาหารหนองแวง":[16.465594, 102.825733]

    // เพิ่มเติมตามความต้องการ
};

// แสดงสถานีบนแผนที่
for (var key in stations) {
    L.marker(stations[key]).addTo(map).bindPopup(key);
}

function calculateRoute() {
    var start = document.getElementById("start").value;
    var end = document.getElementById("end").value;

    alert("เส้นทางจาก " + start + " ถึง " + end);
    // เพิ่มฟังก์ชันการคำนวณเส้นทางต่อรถที่นี่
}
